# 8. Посчитать, сколько раз встречается определенная цифра в введенной последовательности чисел.
# Количество вводимых чисел и цифра, которую необходимо посчитать, задаются вводом с клавиатуры.

count_num = int(input('Введите количество чисел в последовательности: '))
your_char = int(input('Введите цифру, которую нужно посчитать в этих числах: '))
i = 0
for k in range(1, count_num + 1):
    your_num = int(input('Введите число № {0}: '.format(k)))
    while your_num > 0:
        if your_num % 10 == your_char:
            i += 1
        your_num = your_num // 10

print('В ваших числах получилось {0} цифр {1}.'.format(i, your_char))