# Отсортируйте по убыванию методом пузырька одномерный целочисленный массив,
# заданный случайными числами на промежутке [-100; 100).
# Выведите на экран исходный и отсортированный массивы. Примечания:
# алгоритм сортировки должен быть в виде функции, которая принимает на вход массив данных,
# постарайтесь сделать алгоритм умнее, но помните, что у вас должна остаться сортировка пузырьком.
# Улучшенные версии сортировки, например, расчёской, шейкерная и другие в зачёт не идут.
from random import randint

rand_list = [randint(-100, 100) for i in range(15)]
print('Изначальный список: {0}'.format(rand_list))


def bubble_sort(ex_list):
    n = 1
    while n < len(ex_list):
        for i in range(len(ex_list) - n):
            if ex_list[i] > ex_list[i + 1]:
                ex_list[i], ex_list[i + 1] = ex_list[i + 1], ex_list[i]
        n += 1
    return ex_list


print('Отсортированный список: {0}'.format(bubble_sort(rand_list)))
